from django.core.management.base import BaseCommand
from order.models import Locality
import openpyxl


СITY_TYPE = {
             'х': ['хутор', 'х.'],
             'ст': ['станция', 'ст.'],
             'ст-ца': ['станица', 'ст-ца'],
             'аул': ['аул', 'аул'],
             'г': ['город', 'г.'],
             'с': ['село', 'с.'],
             'п': ['посёлок сельского типа', 'п.'],
             'пгт': ['посёлок городского типа', 'пгт'],
             'д': ['деревня', 'д.'],
             'мкр': ['микрорайон', 'мкр'],
             'нп': ['населённый пункт', 'нп'],
             'рп': ['рабочий посёлок', 'рп'],
             'дп': ['дачный посёлок', 'дп'],
             'г.': ['город', 'г.'],
             'у': ['улус', 'у.'],
             'п/ст': ['посёлок при станции', 'п.ст'],
             'с/п': ['сельское поселение', 'сп'],
             'кв-л': ['квартал', 'кв-л'],
             'аал': ['аал', 'аал'],
             'ж/д_ст': ['железнодорожная станция', 'ж/д ст'],
             'кп': ['курортный посёлок', 'кп'],
             'г-к': ['городской округ', 'го'],
             'остров': ['остров', 'ост-в'],
             'высел': ['выселки', 'в-ки'],
             'починок': ['починок', 'п-к'],
             'арбан': ['арбан', 'арбан'],
             'гп': ['городской поселок', 'гп'],
             'с/а': ['сельская администрация', 'с/а'],
             'ж/д бл-ст': ['железнодорожный блокпост', 'ж/д бл-ст'],
             'сл': ['слобода', 'сл'],
             'жилрайон': ['жилой район', 'ж/р'],
             'п. ж/д ст.': ['поселок при железнодорожной станции', 'п. ж/д ст.'],
             'массив': ['массив', 'массив'],
             'сп': ['сельское поселение', 'cп'],
             'сп.': ['Сельское поселение', 'сп'],
             'ж/д о.п.': ['железнодорожный остановочный пункт', 'ж/д оп'],
             'ж/д п.п.': ['железнодорожный путевой пост', 'ж/д пп'],
             'пл.р-н': ['планировочный район', 'пл. р-н'],
             'пгт.': ['поселок городского типа', 'пгт'],
             'поселение': ['поселение', 'пос.'],
            }


class Command(BaseCommand):
    help = "Добавляет в БД города."

    def _parsing_xlsx(self):
        path = 'src/static/data/cities.xlsx'
        wookbook = openpyxl.load_workbook(path)
        try:
            worksheet = wookbook['cities']
            region = worksheet['B']
            mun_district = worksheet['C']
            city_type = worksheet['D']
            city = worksheet['E']
            locality = []
            for i in range(1, len(region)):
                locality.append(
                    Locality(
                     region=region[i].value,
                     mun_district=mun_district[i].value,
                     city_type=СITY_TYPE[city_type[i].value][0],
                     abbreviated_city_type=СITY_TYPE[city_type[i].value][1],
                     city=city[i].value
                    )
                    )
            Locality.objects.bulk_create(locality)
        finally:
            wookbook.close()

    def handle(self, *args, **options):
        self._parsing_xlsx()
